Repository: nawinds/inline-stickers-search-bot
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ru

# callbacks.add_set.cancelled
source: Set adding cancelled
ru: Добавление сета отменено

# callbacks.global.set_not_found
source: Sorry, this set no longer exists
ru: Извините, этот сет больше не существует

# callbacks.add_set.already_added
source: This set is already added to your account
ru: Этот сет уже добавлен в Ваш аккаунт

# callbacks.add_set.adding
source: Adding set...
ru: Добавление сета...

# callbacks.add_set.notification
source: Your *{title}* set was added by someone
ru: Ваш сет *{title}* был кем-то добавлен

# callbacks.add_set.added
source: Set was added successfully!
ru: Сет успешно добавлен!

# callbacks.global.disable
source: Turn off
ru: Выключить

# callbacks.global.enable
source: Turn on
ru: Включить

# callbacks.global.notifications
source: notifications
ru: уведомления

# callbacks.share_set.link_text
source: Here is a link for adding the {title} set. You can now share it with your friends. https://t.me/{username}?start=add\_set-{code} *You can receive notifications when someone adds your set. To enable/disable them, just tap the button below*
ru: Ниже ссылка для добавления сета {title}. Вы можете поделиться ей с друзьями. https://t.me/{username}?start=add\_set-{code} *Вы можете получать уведомления, когда кто-то добавляет Ваш сет. Включать и выключать их можно кнопкой ниже*

# callbacks.notifications.link_not_found
source: Sorry, this link no longer exists
ru: Простите, этой ссылки больше не существует

# callbacks.notifications.notifications_capitalized
source: Notifications
ru: Уведомления

# callbacks.notifications.enabed
source: enabled
ru: включены

# callbacks.notifications.disabed
source: disabled
ru: выключены

# commands.start_deep.not_found
source: You used a link to add a new set, but the specified link does not exist
ru: Вы использовали ссылку для добавления нового сета, но указанная ссылка не существует

# commands.start_deep.yes
source: Yes, add this set
ru: Да, добавить этот сет

# commands.start_deep.no
source: No, thanks
ru: Нет, спасибо

# commands.start_deep.reply_text
source: You used a link to add a *{link_set_title}* set. Are you sure you want to continue?
ru: Вы использовали ссылку для добавления сета *{link_set_title}*. Вы уверены, что хотите продолжить?

# commands.start.hello_text
source: Hi! This bot will help you find your stickers in inline mode. At first you should provide descriptions for every sticker you want to add to search results. */new — add sticker to search index. Use this command if you want to add a description for sticker.* Stickers\' descriptions are collected into _sticker sets_. By default, stickers are kept in a default sticker set, unique for every user. */set — create a new sticker set (you will be asked to send stickers and descriptions for it).* */pack — create a new sticker set based on the sticker pack (bot will send stickers from the sticker pack one by one).* You can share all your sticker sets except for the default set with other users by sending them the link to add your sticker set. */share — create a link for sharing a sticker set.* To search for a sticker in any Telegram chat, just type "@{username}" in the message input field and start typing your query. Sticker suggestions will appear above if there are any. */help — all available bot commands.* */ru — переключить язык на русский.* _If you have any questions or suggestions, feel free to contact @nawinds!_ [Source code of this bot](https://github.com/nawinds/inline-stickers-search-bot)
ru: Привет! Этот бот позволяет искать стикеры в инлайн-режиме. Для начала Вам нужно написать описания для каждого стикера, который Вы хотите добавить в поисковую выдачу. */new — добавить стикер в поиск. Используйте эту команду, если Вы хотите добавить описание для стикера.* Описания стикеров собираются в _сеты стикеров_. По умолчанию, стикеры добавляются в дефолтный сет стикеров, уникальный для каждого пользователя. */set — создать новый сет стикеров (Вам будет необходимо отправить добавляемые стикеры и описания к ним).* */pack — создать новый сет стикеров на основе стикерпака (бот сам будет присылать стикеры из стикерпака по очереди).* Вы можете поделиться всеми своими сетами за исключением дефолтного с другими пользователями, отправив им ссылку на добавление Вашего сета стикеров. */share — создать ссылку для добавления сета стикеров.* Чтобы найти стикер в любом чате Telegram, введите "@{username}" в поле нового сообщения и начните писать свой запрос. Если по Вашему запросу найдутся стикеры, они появятся выше. */help — все доступные команды бота.* _По всем вопросам и предложениям Вы всегда можете написать @nawinds!_ [Исходный код бота](https://github.com/nawinds/inline-stickers-search-bot)

# commands.help.help_text
source: Here is a list of available bot commands: /new — add sticker to search index. Use this command if you want to add a description for sticker. /set — create a new sticker set (you will be asked to send stickers and descriptions for it). /pack — create a new sticker set based on the sticker pack (bot will send stickers from the sticker pack one by one). /share — create a link for sharing a sticker set. /help — all available bot commands. /ru — переключить язык на русский. _If you have any questions or suggestions, feel free to contact @nawinds!_ [Source code of this bot](https://github.com/nawinds/inline-stickers-search-bot)
ru: Ниже список доступных команд: /new — добавить стикер в поиск. Используйте эту команду, если Вы хотите добавить описание для стикера. /set — создать новый сет стикеров (Вам будет необходимо отправить добавляемые стикеры и описания к ним). /pack — создать новый сет стикеров на основе стикерпака (бот сам будет присылать стикеры из стикерпака по очереди). /share — создать ссылку для добавления сета стикеров. /help — все доступные команды бота. _По всем вопросам и предложениям Вы всегда можете написать @nawinds!_ [Исходный код бота](https://github.com/nawinds/inline-stickers-search-bot)

# commands.new
source: Please send a sticker to add it to search results. _To cancel adding a sticker, send /cancel_
ru: Пожалуйста, отправьте стикер, чтобы добавить его в поисковую выдачу. _Чтобы отменить добавление стикера, отправьте /cancel_

# commands.set
source: Please send a title for the new set. _To cancel creating the set, send /cancel_
ru: Придумайте название для своего нового сета. _Чтобы отменить создание сета, отправьте /cancel_

# commands.pack
source: Please send one sticker from the sticker pack you would like to add. _To cancel creating the set, send /cancel_
ru: Пришлите один стикер из стикерпака, который Вы хотите добавить. _Чтобы отменить создание сета, отправьте /cancel_

# commands.process_set_prompt_skip.pack
source: Sticker skipped. Now send a description for the sticker below. If you would like to skip this sticker (not to add it to your set), send /skip. If you don't want to continue adding stickers to this set, send /finish_set
ru: Стикер пропущен. Теперь отправьте описание для стикера ниже. Если Вы хотите пропустить этот стикер и не добавлять его в стикерпак, отправьте /skip. Если Вы больше не хотите добавлять стикеры в этот сет, отправьте /finish_set

# commands.process_set_prompt_skip.finish_set
source: There are no more stickers in this sticker pack. Stickers set is saved!
ru: Больше стикеров в этом стикерпаке нет. Сет сохранён!

# commands.process_set_prompt_finish.default_saved
source: Sticker saved
ru: Стикер сохранён

# commands.process_set_prompt_finish.pack
source: Sticker saved. Now send a description for the sticker below. If you would like to skip this sticker (not to add it to your set), send /skip. If you don't want to continue adding stickers to this set, send /finish_set
ru: Стикер сохранён. Теперь отправьте описание для стикера ниже. Если Вы хотите пропустить этот стикер и не добавлять его в стикерпак, отправьте /skip. Если Вы больше не хотите добавлять стикеры в этот сет, отправьте /finish_set

# commands.process_set_prompt_finish.sticker_saved
source: Sticker saved. Now send another sticker. If you don't want to add another sticker to this set, send /finish_set
ru: Стикер сохранён. Теперь отправьте следующий стикер. Если Вы больше не хотите добавлять стикеры в этот сет, отправьте /finish_set

# commands.finish_set
source: Ok. Your set is now saved
ru: Ок. Сет сохранён

# commands.cancel
source: Action cancelled
ru: Действие отменено

# commands.share.no_sets
source: You don't have sticker sets that you can share. Create one with /set command
ru: У Вас нет сетов стикеров, которыми можно поделиться. Создайте такой сет командой /set

# commands.share.choose
source: Please choose a sticker set you would like to share and I will generate a link
ru: Пожалуйста, выберите сет стикеров, которым Вы хотите поделиться и я сгенерирую ссылку

# data_processing.set_title.limit
source: This title exceeds 50 characters. Please, try again
ru: Название не должно быть длиннее 50 символов. Пожалуйста, попробуйте еще раз

# data_processing.set_title.existing
source: A set with this title already exists. Please, try again
ru: Сет с таким названием уже существует. Пожалуйста, попробуйте еще раз

# data_processing.set_title.pack
source: Sticker set created! Now I will start sending stickers from the sticker pack one by one. There is the first sticker below. Please, send a description for it. If you would like to skip this sticker (not to add it to the set), send /skip.
ru: Сет стикеров создан! Теперь я буду по очереди присылать Вам стикеры из стикерпака. Ниже пришлю первый стикер. Пожалуйста, придумайте описание для него. Если Вы хотите пропустить этот стикер и не добавлять его в стикерпак, отправьте /skip.

# data_processing.set_title.success
source: Sticker set created! Please send the first sticker for your new set
ru: Сет стикеров создан! Отправьте первый стикер для Вашего сета

# data_processing.set_sticker.pack
source: Send a title for this sticker set
ru: Придумайте название для этого сета стикеров

# data_processing.set_sticker
source: Send a prompt for this sticker
ru: Отправьте описание для этого стикера

# data_processing.set_prompt.limit
source: This prompt exceeds 1000 characters. Please, try again
ru: Описание не должно быть длиннее 1000 стикеров. Пожалуйста, попробуйте ещё раз

# data_processing.set_prompt.success
source: Send another prompt for this sticker. To finish, send /finish
ru: Отправьте еще одно описание для этого стикера. Если Вы не хотите добавлять больше описаний для стикера, воспользуйтесь командой /finish

# inline.handle.not_found
source: Add stickers to search >>
ru: Добавить стикеры в поиск >>
